<template>
  <div class="item__desc">
    <ul class="tabs">
      <li class="tabs__item" v-for="tab in tabs" @click="currentTab = tab" :key="tab">
        <div :class="['tabs__link', {'tabs__link--current':currentTab === tab}]">
          {{tab}}
        </div>
      </li>
    </ul>

    <div class="item__content" v-if="currentTab===tabs[0]">
      <p>
        [текст из приходящего ответа]
        <!--            Навигация GPS, ГЛОНАСС, BEIDOU Galileo и QZSS<br>-->
        <!--            Синхронизация со смартфоном<br>-->
        <!--            Связь по Bluetooth Smart, ANT+ и Wi-Fi<br>-->
        <!--            Поддержка сторонних приложений<br>-->
      </p>

      <a href="#">
        Все характеристики
      </a>

      <h3>Что это?</h3>

      <p>
        <!--            Wahoo ELEMNT BOLT GPS – это велокомпьютер, который позволяет оптимизировать свои велотренировки, сделав их максимально эффективными. Wahoo ELEMNT BOLT GPS синхронизируется с датчиками по ANT+, объединяя полученную с них информацию. Данные отображаются на дисплее, а также сохраняются на смартфоне. При этом на мобильное устройство можно установить как фирменное приложение, так и различные приложения сторонних разработчиков. Велокомпьютер точно отслеживает местоположение, принимая сигнал с целого комплекса спутников. Эта информация позволяет смотреть уже преодоленные маршруты и планировать новые велопрогулки.-->
        [текст из приходящего ответа]
      </p>

      <h3>Дизайн</h3>

      <p>
        [текст из приходящего ответа]
        <!--            Велокомпьютер Wahoo ELEMNT BOLT очень компактный. Размеры устройства составляют всего 74,6 x 47,3 x 22,1 мм. что не превышает габариты смартфона. Корпус гаджета выполнен из черного пластика. На обращенной к пользователю стороне расположен дисплей диагональю 56 мм. На дисплей выводятся координаты и скорость, а также полученная со смартфона и синхронизированных датчиков информация: интенсивность, скорость вращения педалей, пульс и т.д. (датчики не входят в комплект поставки). Корпус велокомпьютера имеет степень защиты от влаги IPX7. Это означает, что устройство не боится пыли, а также выдерживает кратковременное (до 30 минут) погружение в воду на глубину не более 1 метра.-->
      </p>
    </div>
    <div class="item__content" v-if="currentTab===tabs[1]">
      <p>
        [харки из приходящего ответа]
      </p>
    </div>
    <div class="item__content" v-if="currentTab===tabs[2]">
      <p>
        [гарантии из приходящего ответа]
      </p>
    </div>
    <div class="item__content" v-if="currentTab===tabs[3]">
      <p>
        [доставка из приходящего ответа]
      </p>
    </div>
  </div>

</template>

<script>
  export default {
    props:['productData'],
    data() {//локальн стейт
      return {
        tabs:['Описание','Характеристики','Гарантия','Оплата и доставка'],
        currentTab: 'Описание',
      };
    },
    computed: {
      // currentTabComponent() {
      //   return "Test" + this.currentTab;
      // }
    },
    methods: {
    },
  };
</script>

<style>

</style>
